src/mp_toir/Documents/мп_РегистрацияПроверокОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_РегистрацияПроверокОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Проверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбъектаЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Catalogs/ОбъектыЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологическоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мечел_ТехнологическиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаработкаНаДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Catalogs/КлассыОбъектовЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассыОбъектовЭксплуатации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиНаработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>мп_ВидыПроверок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроверокОборудования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/mp_toir/Documents/мп_РегистрацияПроверокОборудования/Forms/ФормаСтрокиПроверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "НомерСтроки, ТехнологическоеМесто, ОбъектЭксплуатации, УзелОбъектаЭксплуатации,"
		+ "ВидПроверки, Комментарий, РезультатПроверки";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы, ИменаЭлементов + ", ФормаЗаписать", "Доступность", Не Параметры.ТолькоПросмотр);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЭтотОбъект.СохранитьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("ТехнологическоеМесто", ЭтотОбъект.ТехнологическоеМесто);
	ЗначенияСтроки.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	ЗначенияСтроки.Вставить("УзелОбъектаЭксплуатации", ЭтотОбъект.УзелОбъектаЭксплуатации);
	ЗначенияСтроки.Вставить("ВидПроверки", ЭтотОбъект.ВидПроверки);
	ЗначенияСтроки.Вставить("Комментарий", ЭтотОбъект.Комментарий);
	ЗначенияСтроки.Вставить("РезультатПроверки", ЭтотОбъект.РезультатПроверки);

	ОповеститьОВыборе(ЗначенияСтроки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТехнологическоеМестоПриИзменении(Элемент)
	
	ОбъектЭксплуатации = ОбщегоНазначенияВызовСервера.ОбъектыЭксплуатацииПоТехМесту(
		ЭтотОбъект.ТехнологическоеМесто, Истина);
	
	Если ТипЗнч(ОбъектЭксплуатации) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		ЭтотОбъект.ОбъектЭксплуатации = ОбъектЭксплуатации;
	Иначе
		ЭтотОбъект.ОбъектЭксплуатации =
			ПредопределенноеЗначение("Справочник.ОбъектыЭксплуатации.ПустаяСсылка");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭксплуатацииПриИзменении(Элемент)

	ЭтотОбъект.ТехнологическоеМесто = ТехнологическоеМестоПоОЭ(ЭтотОбъект.ОбъектЭксплуатации);

КонецПроцедуры

&НаКлиенте
Процедура УзелОбъектаЭксплуатацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбъектЭксплуатации = ЭтотОбъект.ОбъектЭксплуатации;

	МассивЭлементов = Новый Массив;
	Если ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		
		УзлыОбъектов = ОбщегоНазначенияВызовСервера.УзлыОбъектаЭксплуатации(ОбъектЭксплуатации);
		Если Не УзлыОбъектов = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", УзлыОбъектов);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПроверкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Узел = ЭтотОбъект.УзелОбъектаЭксплуатации;
	Если Не ЗначениеЗаполнено(Узел) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	ВидыПроверок = ВидыПроверокПоУзлу(Узел);
	
	Если ВидыПроверок = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	Иначе
		МассивЭлементов = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ВидыПроверок);
		МассивЭлементов.Добавить(НовыйПараметр);
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ПустойУзел = ПредопределенноеЗначение("Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка");
	Если ЭтотОбъект.УзелОбъектаЭксплуатации = ПустойУзел Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите узел объекта эксплуатации", , "УзелОбъектаЭксплуатации");
		Возврат;
	КонецЕсли;
	Если ЭтотОбъект.ВидПроверки = ПредопределенноеЗначение("Справочник.мп_ВидыПроверокОборудования.ПустаяСсылка") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите вид проверки", , "ВидПроверки");
		Возврат;
	КонецЕсли;
	ЭтотОбъект.СохранитьИзменения = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТехнологическоеМестоПоОЭ(Знач ОбъектЭксплуатации)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЭксплуатации, "ТехнологическоеМесто");
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидыПроверокПоУзлу(Знач Узел)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УзлыОбъектовЭксплуатации.Класс КАК Класс
	|ПОМЕСТИТЬ вт_КлассУзла
	|ИЗ
	|	Справочник.УзлыОбъектовЭксплуатации КАК УзлыОбъектовЭксплуатации
	|ГДЕ
	|	УзлыОбъектовЭксплуатации.Ссылка = &Узел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлассыОбъектовЭксплуатациимп_ВидыПроверок.ВидПроверокОборудования КАК ВидПроверокОборудования
	|ИЗ
	|	Справочник.КлассыОбъектовЭксплуатации.мп_ВидыПроверок КАК КлассыОбъектовЭксплуатациимп_ВидыПроверок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КлассУзла КАК вт_КлассУзла
	|		ПО (вт_КлассУзла.Класс = КлассыОбъектовЭксплуатациимп_ВидыПроверок.Ссылка)";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВидПроверокОборудования");
	КонецЕсли;

КонецФункции

#КонецОбласти
